// 条件を満たす最小のrをみつけるしゃくとり
// しゃくとり[l, r]
int l = 0;
for (int r = 0; r < n; ++r) {
    // TODO: rの分をいれる処理を書く

    while (条件を満たさない and l <= r) {
        // TODO: lの分を消す処理を書く
        pass

        ++ l;
    }

    if (条件を満たす) {
        // TODO: 答えの更新処理を書く
    }
}


// 条件を満たす最大のrをみつけるしゃくとり
// しゃくとり[l, r)
int r = 0;
for (int l = 0; l < n; ++l) {
    // rを進められるだけ進める
    while (r < n and rを加えても条件を満たす) {
        // TODO: rを進めた処理を書く
        // TODO: [l, r)での答えの更新処理を書く
        ++r;
    }

    if (条件を満たす) {
        // TODO: [l, r)での答えの更新処理を書く
    }

    if (l == r) {
        r++;
    } else {
        // TODO: lを1つ進めたときの処理を書く
    }
}